{"config": [{"config": {"bias_regularizer": null, "name": "conv2d_1", "dtype": "float32", "batch_input_shape": [null, 28, 28, 1], "kernel_constraint": null, "kernel_initializer": {"config": {"distribution": "uniform", "mode": "fan_avg", "scale": 1.0, "seed": null}, "class_name": "VarianceScaling"}, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "data_format": "channels_last", "strides": [1, 1], "activity_regularizer": null, "use_bias": true, "kernel_regularizer": null, "padding": "same", "kernel_size": [3, 3], "dilation_rate": [1, 1], "activation": "relu", "trainable": true, "bias_constraint": null, "filters": 32}, "class_name": "Conv2D"}, {"config": {"kernel_initializer": {"config": {"distribution": "uniform", "mode": "fan_avg", "scale": 1.0, "seed": null}, "class_name": "VarianceScaling"}, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "activity_regularizer": null, "name": "conv2d_2", "kernel_regularizer": null, "data_format": "channels_last", "strides": [1, 1], "kernel_constraint": null, "use_bias": true, "bias_regularizer": null, "padding": "valid", "kernel_size": [3, 3], "dilation_rate": [1, 1], "activation": "relu", "trainable": true, "bias_constraint": null, "filters": 64}, "class_name": "Conv2D"}, {"config": {"strides": [2, 2], "pool_size": [2, 2], "padding": "valid", "name": "max_pooling2d_1", "data_format": "channels_last", "trainable": true}, "class_name": "MaxPooling2D"}, {"config": {"name": "dropout_1", "trainable": true, "rate": 0.25}, "class_name": "Dropout"}, {"config": {"name": "flatten_1", "trainable": true}, "class_name": "Flatten"}, {"config": {"bias_initializer": {"config": {}, "class_name": "Zeros"}, "activity_regularizer": null, "kernel_initializer": {"config": {"distribution": "uniform", "mode": "fan_avg", "scale": 1.0, "seed": null}, "class_name": "VarianceScaling"}, "bias_regularizer": null, "name": "dense_1", "units": 128, "kernel_constraint": null, "use_bias": true, "kernel_regularizer": null, "activation": "relu", "trainable": true, "bias_constraint": null}, "class_name": "Dense"}, {"config": {"name": "dropout_2", "trainable": true, "rate": 0.5}, "class_name": "Dropout"}, {"config": {"bias_initializer": {"config": {}, "class_name": "Zeros"}, "activity_regularizer": null, "kernel_initializer": {"config": {"distribution": "uniform", "mode": "fan_avg", "scale": 1.0, "seed": null}, "class_name": "VarianceScaling"}, "bias_regularizer": null, "name": "preds", "units": 10, "kernel_constraint": null, "use_bias": true, "kernel_regularizer": null, "activation": "softmax", "trainable": true, "bias_constraint": null}, "class_name": "Dense"}], "class_name": "Sequential", "keras_version": "2.0.8", "backend": "tensorflow"}